md848-cornell/NRF-ROKIX-sensor-mesh/firmware/nrf5SDKforMeshv310src/examples/light_switch44/provisioner/src/main.c
bool load_app_data(void)
{
    return false;
}
static uint32_t store_app_data(void)
{
    return NRF_SUCCESS;
}

#endif


static void app_data_store_cb(void)
{
    ERROR_CHECK(store_app_data());
}

static const char * server_uri_index_select(const char * p_client_uri)
{
    if (strcmp(p_client_uri, EX_URI_LS_CLIENT) == 0 || strcmp(p_client_uri, EX_URI_ENOCEAN) == 0)
    {
        return EX_URI_LS_SERVER;
    }
    else if (strcmp(p_client_uri, EX_URI_DM_CLIENT) == 0)
    {
        return EX_URI_DM_SERVER;
    }

    __LOG(LOG_SRC_APP, LOG_LEVEL_ASSERT, "Invalid client URI index.\n");
    NRF_MESH_ASSERT(false);

    return NULL;
}

/*****************************************************************************/
/**** Configuration process related callbacks ****/

static void app_config_successful_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Configuration of device %u successful\n", m_nw_state.configured_devices);

    hal_led_pin_set(APP_CONFIGURATION_LED, 0);

    m_nw_state.configured_devices++;
    access_flash_config_store();
    ERROR_CHECK(store_app_data());

    if (m_nw_state.configured_devices < (SERVER_NODE_COUNT + CLIENT_NODE_COUNT))
    {
        static const char * uri_list[1];
        uri_list[0] = server_uri_index_select(m_nw_state.p_client_uri);
        prov_helper_provision_next_device(PROVISIONER_RETRY_COUNT, m_nw_state.next_device_address,
                                           uri_list, ARRAY_SIZE(uri_list));
        prov_helper_scan_start();

        hal_led_pin_set(APP_PROVISIONING_LED, 1);
    }
    else
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "All servers provisioned\n");

        hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_PROV);
    }
}

static void app_config_failed_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Configuration of device %u failed. Press Button 1 to retry.\n", m_nw_state.configured_devices);
    m_node_prov_setup_started = false;
    hal_led_pin_set(APP_CONFIGURATION_LED, 0);
}

static void app_prov_success_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Provisioning successful\n");

    hal_led_pin_set(APP_PROVISIONING_LED, 0);
    hal_led_pin_set(APP_CONFIGURATION_LED, 1);

    ERROR_CHECK(store_app_data());
}

static void app_prov_failed_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Provisioning failed. Press Button 1 to retry.\n");
    m_node_prov_setup_started = false;

    hal_led_pin_set(APP_PROVISIONING_LED, 0);
}


/*****************************************************************************/
/**** Model related callbacks ****/
static void app_health_event_cb(const health_client_t * p_client, const health_client_evt_t * p_event)
{
    if (1)
    {
    switch (p_event->type)
    {
        case HEALTH_CLIENT_EVT_TYPE_CURRENT_STATUS_RECEIVED:
            __LOG(LOG_SRC_APP,
                  LOG_LEVEL_INFO,
                  "Node 0x%04x alive with %u active fault(s), RSSI: %d\n",
                  p_event->p_meta_data->src.value,
                  p_event->data.fault_status.fault_array_length,
                  ((p_event->p_meta_data->p_core_metadata->source == NRF_MESH_RX_SOURCE_SCANNER)
                       ? p_event->p_meta_data->p_core_metadata->params.scanner.rssi
                       : 0));
            if (p_event->data.fault_status.fault_array_length > 0)
            {
              for (uint8_t i = 0; i < p_event->data.fault_status.fault_array_length; i++)
              {
                  __LOG(LOG_SRC_APP,LOG_LEVEL_INFO,"Fault: %d | Code: %d\n",i, p_event->data.fault_status.p_fault_array[i]);
              }
            }
            break;
        default:
            break;
    }
    }
}

static void app_bsense_event_cb(const bsense_client_t * p_client, const bsense_client_evt_t * p_event)
{
    int16_t v1;
    int16_t v2;
    int16_t v3;

    switch (p_event->type)
    {
        case bsense_CLIENT_EVT_TYPE_CURRENT_STATUS_RECEIVED:

                  
                  v1 = ((int16_t) p_event->data.data_status.p_data_array[1] << 8) | (int16_t)p_event->data.data_status.p_data_array[0];
                  v2 = ((int16_t) p_event->data.data_status.p_data_array[3] << 8) | (int16_t)p_event->data.data_status.p_data_array[2];
                  v3 = ((int16_t) p_event->data.data_status.p_data_array[5] << 8) | (int16_t)p_event->data.data_status.p_data_array[4];
                  __LOG(LOG_SRC_APP,
                  LOG_LEVEL_INFO,
                  "current: BSENSE msg - Node 0x%04x (TTL:%d) - sensor data: %d %d %d\n",
                  p_event->p_meta_data->src.value,
                  p_event->p_meta_data->ttl,
                  v1, v2, v3);
            break;

        case bsense_OPCODE_ATTENTION_STATUS:
            __LOG(LOG_SRC_APP,
                  LOG_LEVEL_INFO,
                  "attn: BSENSE Node 0x%04x data: %u\n",
                  p_event->p_meta_data->src.value,
                  p_event->data.data_status.p_data_array[0]);
            break;
        default:
            __LOG(LOG_SRC_APP,LOG_LEVEL_INFO,"OTHER BSENSE EVENT TYPE: %d\n",p_event->type)
            break;
    }
}

static void app_config_server_event_cb(const config_server_evt_t * p_evt)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "config_server Event %d.\n", p_evt->type);

    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET)
    {
        /* This should never return */
        hal_device_reset(0);
    }
}

static void app_config_client_event_cb(config_client_event_type_t event_type, const config_client_event_t * p_event, uint16_t length)
{
    /* USER_NOTE: Do additional processing of config client events here if required */
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Config client event\n");

    /* Pass events to the node setup helper module for further processing */
    node_setup_config_client_event_process(event_type, p_event, length);
}


